{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution1D", "config": {"batch_input_shape": [null, null, 1], "W_constraint": null, "b_constraint": null, "name": "convolution1d_10", "activity_regularizer": null, "trainable": true, "filter_length": 32, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dtype": "float32", "subsample_length": 1, "border_mode": "valid", "input_dim": 1, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "MaxPooling1D", "config": {"stride": 32, "pool_length": 32, "trainable": true, "name": "maxpooling1d_10", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"batch_input_shape": [null, null, 1], "W_constraint": null, "b_constraint": null, "name": "convolution1d_11", "activity_regularizer": null, "trainable": true, "filter_length": 16, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dtype": "float32", "subsample_length": 1, "border_mode": "valid", "input_dim": 1, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "MaxPooling1D", "config": {"stride": 16, "pool_length": 16, "trainable": true, "name": "maxpooling1d_11", "border_mode": "valid"}}, {"class_name": "Convolution1D", "config": {"batch_input_shape": [null, null, 1], "W_constraint": null, "b_constraint": null, "name": "convolution1d_12", "activity_regularizer": null, "trainable": true, "filter_length": 8, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dtype": "float32", "subsample_length": 1, "border_mode": "valid", "input_dim": 1, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"class_name": "MaxPooling1D", "config": {"stride": 8, "pool_length": 8, "trainable": true, "name": "maxpooling1d_12", "border_mode": "valid"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 96}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "globalmaxpooling1d_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 96, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}]}